/* =============================================================
    BOM [ Browser Object Model ]

        History Objec

            Properties
                - length

            Methods
                - back()
                - forward()
                - go(Delta) => Position in history
================================================================ */





/* =================== history.length =================== */

// كيعطيك عدد العناصر لي فالسجل بما فيهم الصفحة لي فيها دبا نتا length ال





/* =================== history.back() =================== */

// كترجعك صفحة للور





/* =================== history.forward() =================== */

// كيزيد بيك صفحة للقدام




/* =================== history.go(Delta) =================== */


/*
    history.go(0) =>  للصفحة لي فيها دبا نتا reload بحال الا كدير

    history.go(1 || 2 || ...) =>  لكان العدد موجب كيزيد بيك عدد الصفحات لي بغيتي للقدام

    history.go(-1 || -2 || -...) =>  كيرجعك عدد الصفحات لي بغيتي للور
*/