/* ===============================================================
    Scope: 
        - Global & Local
================================================================== */

/**
 * * Scope?
    هو مفهوم التحكم في التواجدية ديال المتغيرات عن طريقو تقدر تعرف هاد المتغير منين تقدر تتدخل ليه ومنين ميمكنش ليك تدخل منو ليه.
    حيت ماشي من المنطقي فالابليكيشن تاعك تقدر تدخل للمتغيرات من اي بلاصة، حيت السكوب كيلعب دور حتا
*/


let a = 1;
let b = 2;

function showText() {
    console.log(`Function - from Local ${a}`)
    console.log(`Function - from Local ${b}`)
}
showText()

console.log(`from global ${a}`)
console.log(`from global ${b}`)


/**
 * يعني يمكن ليك تدخل ليه من اي بلاصة global scop فراه كيكون فال function اولا فاش مكديرش المتغير داخل ال
 * 
 * * * local scop عندها سكوب خاص بيها function ال
 * كتقلب هو اللول السكوب المحلي الا لقاتو كتخدم بيه function يعني ال فاش كتستدعي شي متغير فال
   ملقاتوش كتمشي دوز للسكوب الجلوبال تقلب فيه
 * initialisation ديال error فراه خاصك ديكلاري بيه لفوق هو باش تجنب ال local scope فحالة كتي درتي متغير فال
*/

/**
 * error كتي ستادعيتي شي متغير للغلوبال سكوب غيقلب عليه فالغلوبال سكوب ملقاهش غيطلع ليك
 * مغيقدرش يوصل ليه function يعني واخا يكون المتغير لي ستدعيتي فلداخل ديال شي
 */