/* ===============================================================
    Anonymous Functions
        - Definition
        - Calling Named function  &  Anonymous function
================================================================== */


/**
 * ? Definition  &  Calling 
 */

function calc(num1, num2) {
    return num1 + num2
}
console.log(calc(2, 233))
// معروفة حيت عندها سمية و تقدر تستدعيها سواء قبل متنشئها اولا بعد متنشئها function دبا هدي



// variable معندهاش سمية و كتخزن ف function هي anonymous function اما بالنسبة لل
// و كتستدعيها بعد متعرفها حيت هيا كتكون ف متغير و المتغير كتستدعيه بعدما كتنشئو
let claculating = function (num1, num2) {
    return num1 + num2
}
console.log(claculating(10, 20))
// error هادشي مكيعنيش انك متقدرش تسميها، تقد تسميها بلي بغيتي وخا هي داخل المتغير غار الا حاولتي تستدعيها بالسمية لي درتي ليها و ماشي ديال المتغير غيطلع ليك
// فين كاين الا عندك بزاف دالاخطاء error والحكمة من التسمية وخا هي داخل المتغير انك تقدر توصل لل



/**
 * ? function شناهي الحكمة من انك متسميش
 *
 *  دير حاجة معينة. وهادي مكاين لاش تبقا تفكر فشي سمية ليها button من الاسباب مثلا فاش تكليكي على شي
 */