/* ============================================================
    Regular Expressions

            Quantifiers :

                n{x}    => number of   (عدد محدد من الكراكتر)
                n{x,y}  => range       (رينج من الاعداد بين و بين)
                n{x,}   => at least x  (على الاقل لفوق)

=============================================================== */

// ماشي بالضرورة الكراكتر كلاس ديال الارقام و انما اي كراكتر كلاس تقدر تحدد ليه شحال بغيتي منو

let serials = "S100S S3000S S50000S S950000S";

console.log(serials.match(/s\d{3}s/ig)); // ['S100S']

console.log(serials.match(/s\d{4,5}s/ig)); // ['S3000S', 'S50000S']

console.log(serials.match(/s\d{4,}s/ig)); // ['S3000S', 'S50000S', 'S950000S']