/*
    Math Object
        - round()
        - ceil()
        - floor()
        - min()
        - max()
        - pow()
        - random()
        - trunc()
*/



/* =================== round() ======================== */

// الا كان العدد العشري صغر من 5 كيهبطو تال 0 وكيطبع العدد بلا العشر
// اما الا كان العدد العشري اكبر من او يساوي 5. فراه كيزيد عليه تايولي 1 يعني كيطبع العدد زائد 1
console.log(Math.round(99.3));
console.log(Math.round(99.5));

console.log("");



/* =================== ceil() ======================== */

// كتعني السقف
// يعني انفوا يكون العدد فيه رقم عشري واخا يكون قل من 5 غيطلعو تايكون 1
console.log(Math.ceil(99.2));

console.log("");



/* =================== floor() ======================== */

// كتعني الارض
// اي لاكان عدد غير صحيح فيه رقم عشري واخا يفوت 5 كيهبطو لل 0 
console.log(Math.floor(99.9));

console.log("");



/* =================== min() & max() ======================== */

// نفس القضية بجوج, كتعطيعهم ارقام وكيخرجو ليك العدد الاكبر او الاصغر فيهم
console.log(Math.min(2, 34, 23, 54, 1, 29));
console.log(Math.max(2, 42, 42, 21, 68, 6));

console.log("")


/* =================== pow() ======================== */

// الأس 
console.log(Math.pow(20, 2))
// same as
console.log(10 ** 2)

console.log("")



/* =================== random() ======================== */

// فالحالة العادية كيعطيك رقم عشوائي كلما كدير ريلود للباج
// ولكن من بعد غنتعلم كيفاش تخليه يعطيك رقم عشوائي فرينج معين نتا لي كتعطيه ليه
console.log(Math.random())

console.log("")



/* =================== trunc() ======================== */

// وهي القص, يعني لكان عدد عشري. كتحيد الرقم العشري كيما كان كبر ولا صغر من 5 و كيطبع ليك العدد الصحيح
console.log(Math.trunc(99.4))
console.log(Math.trunc(99.9))